---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
source: html/0cf06d2a-9f90-bcf0-f44b-74fac30b4bfd.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsEqual Method

Checks if the contents of two settings are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	PointCloudOverrideSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings`) - The settings to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null